[
  {
    "date": "December 2001",
    "body": "The Mariners trade three players for third baseman Jeff Cirillo, who had hit at least .314 his previous four seasons. In two seasons with Seattle, he hit a combined .234.",
    "crowd": 3
  },
  {
    "date": "July 2002",
    "body": "The Mariners don’t upgrade at the trade deadline, upsetting famed manager Lou Piniella, who is dealt to Tampa Bay that offseason at his request in a player-manager swap. “His name has come up in connection to job openings, especially in his Tampa hometown, because he reportedly wants to return East and because he was disillusioned that Mariner management refused to spend extra money near the trading deadline to upgrade the roster,” [The New York Post’s Joel Sherman wrote](https://nypost.com/2002/10/03/gillick-sweet-lou-staying-in-seattle/). General manager Pat Gillick would leave for the Phillies a year later, the Mariners’ major-league roster aging and farm system decimated.\n\nHinting at his dissatisfaction, when asked about the Astros’ acquisition of then-Mariner Randy Johnson at the 1997 trade deadline, Piniella responded: \"They were trying to win the World Series, and they thought Randy would be a major factor. I think if you have a team that's one piece short, you owe it to your fans to give it a go — and to your players. How many teams get in position that way? But you have to make darn sure that's the piece. You can decimate your farm system real quick.\"",
    "photo": "2002-web.jpg",
    "full": "x",
    "crowd": 1
  },
  {
    "date": "Nov. 7, 2003",
    "header": "The Bill Bavasi era begins",
    "crowd": 4
  },
  {
    "date": "Dec. 19, 2003",
    "body": "Spiezio hits .215/.288/.346 during his one full season in Seattle, after signing a three-year, $9.15 million contract. He was released midway through 2005, barely a year and half after inking his deal.",
    "crowd": 2
  },
  {
    "date": "October 2004",
    "body": "To begin the final series of his greatest major-league season, Ichiro slaps three hits — Nos. 258, 259 and 260 — to pass George Sisler for the season hits record of 257. Despite a dreadful 63-99 record, a sold-out Safeco Field salutes Ichiro with a standing ovation, and proceeds to witness hits 261 and 262 two days later in the season finale.",
    "crowd": 6
  },
  {
    "date": "Dec. 15, 2004",
    "body": "Bavasi hands out $50 million over four years to Richie Sexson. He’s solid for two seasons (despite leading the league in strikeouts in 2005) before his production plummets in 2007 and the Mariners release him midway through the following season. As a Mariner, Sexson struck out in 23.6 percent of his at-bats.",
    "photo": "2004-web.jpg",
    "crowd": 1
  },
  {
    "date": "July 2006",
    "body": "Within a month of each other, the Mariners deal Shin-Soo Choo and Asdrubal Cabrera to the Indians in two separate trades. Choo and Cabrera each went on to have All-Star careers and help lead multiple Cleveland playoff runs. In return, Seattle acquired Eduardo Perez and Ben Broussard, a first-base platoon that had combined to hit .316 with 21 home runs for Cleveland that season. The duo wouldn’t come close to replicating its success with the Tribe, slashing .223/.290/.363 with Seattle.\n\nSeattle went 37-44 following the Perez trade — 29-32 after Choo — and finished in last place, 15 games out (and with the same record as the Indians).\n\nSeattle’s midseason fleecing came in a desperate attempt to upgrade over 35-year-old Carl Everett, whom Bavasi had signed to a $3.4 million deal to be the team’s everyday DH. The contract would be Everett’s last, as he was released after hitting .227 in 92 games.\n\nThat offseason, the Mariners dealt Rafael Soriano, a promising arm and future closer, for Horacio Ramirez, who posted a 7.16 ERA in his lone season in Seattle.\n\n“More than anything else, the trades that year were just good old-fashioned disasters,” [Bavasi later told Rob Neyer in retrospect](https://www.sbnation.com/2013/12/26/5246272/trading-shin-soo-choo-mariners-general-manager-bill-bavasi).",
    "crowd": 0
  },
  {
    "date": "Jul. 1, 2007",
    "body": "Manager Mike Hargrove abruptly resigns midseason with his team riding an eight-game winning streak. The Mariners handed the reins to John McLaren and Hargrove drove out of town, California-bound in his red pickup truck. According to the Elias Sports Bureau, Hargrove was the first big-league manager since at least 1900 to exit while on a winning streak of more than seven games.",
    "crowd": 0
  },
  {
    "date": "Aug. 5, 2007",
    "body": "The Moose’s humor was really a little too on the nose when he crashed his ATV into a player on the Safeco Field warning track. The victim, then-Red Sox outfielder Coco Crisp, wasn’t injured. “I’m not an angry man,” Crisp said. “It was an accident. I mean, I’m not going to run over and clothesline the guy.”",
    "photo": "coco-crossing.jpg",
    "crowd": 2
  },
  {
    "date": "December 2007",
    "body": "Bavasi gives $48 million over four years to Carlos Silva, who throws a whole 183 ⅔ innings for Seattle over one-plus season. He goes 5-18 with a 6.81 ERA, managing to accrue -2.8 WAR. Worse yet: Silva is dealt to the Cubs for Milton Bradley, who that offseason (January 2011) is arrested for making threats against his wife, whose abusive relationship was [later detailed by Sports Illustrated](https://www.si.com/mlb/2015/04/08/milton-bradley-domestic-abuse-mlb-monique-bradley).\n\nThe week leading up to Bradley’s release, [from Geoff Baker](https://www.seattletimes.com/sports/mariners/mariners-cut-ties-with-milton-bradley/): “On Friday, Bradley was ejected in the eighth inning of a tie game for arguing a strikeout, leaving the Mariners with a short-handed bench that prevented them from pinch-running in a key situation. Bradley was booed after failing to get to several balls hit his way Saturday. Then on Sunday, his poor throw led to a disastrous chain of events and two critical Chicago runs on the same play.”",
    "crowd": 1
  },
  {
    "date": "February 2008",
    "body": "It’s the most infamous move in Mariners history. Bavasi trades top prospect and soon-to-be perennial All-Star Adam Jones along with Chris Tillman, a future starter with five years of club control, and a trio of prospects for Erik Bedard.\n\nThe canary began chirping before even Opening Day. Bedard was named Opening Day starter, leaving young ace Felix Hernandez “extremely irked,” Ryan Divish later reported. “And we also later found out that Bedard was uncomfortable in that situation of having the spotlight on him as the opening day starter and supposed staff ace. Not one of McLaren's best ideas.”\n\nYet, at the time manager John McClaren reasoned: “Y'all are going to make a bigger deal out of this than anybody else. Felix is fine with it. We're fine with it. We just think this is the best route to go at this point.”\n\nConsidered by many the favorites in the West, the Mariners won 61 games in 2008, and Bedard never pitched more than 129 ⅓ innings in a season during his injury-plagued three and a half years in Seattle.",
    "photo": "2008-web.jpg",
    "crowd": 0
  },
  {
    "date": 2008,
    "body": "33-year-old Jose Vidro (.234) bats cleanup 13 times. Really.",
    "crowd": 0
  },
  {
    "date": "June 2008",
    "body": "The Mariners securely in last place and sensing the end was near, Bavasi wanted to hold his players accountable. So he withheld their postgame meal until they faced the media, which was already hearing it from McLaren in a rant that even rivaled those from Sweet Lou. “We’re playing our asses off every day and have got nothing to show for it. I’m tired of (expletive) losing, I’m tired of getting my ass beat and so are those guys.” McLaren was fired a little more than two weeks later (three days after Bavasi). The team had the worst record in baseball (25-47) and a $100 million-plus payroll.",
    "photo": "2007-web.jpg",
    "full": "x",
    "crowd": 0
  },
  {
    "date": "June 16, 2008",
    "header": "Bill Bavasi fired",
    "crowd": 3
  },
  {
    "date": "Oct. 22, 2008",
    "header": "The Jack Zduriencik era begins",
    "crowd": 5
  },
  {
    "date": "December 2009",
    "body": "Mariners give little Chone Figgins a four-year, $36 million contract. He hits a career-worst .259 in his first season in Seattle and only goes downhill from there, to .188 then .181 before the Mariners designate him for assignment after the 2012 season. It isn’t mathematically possible to deduce Figgins’ value by means of dollar per WAR. You can’t divide by zero.",
    "photo": "2009-web.jpg",
    "crowd": 2
  },
  {
    "date": 2010,
    "body": "Ichiro, Felix and Cliff Lee are featured on ESPN The Magazine’s baseball preview cover. Not halfway through the season, sitting at 33-44, the Mariners traded Lee for a package of Justin Smoak, Blake Beavan, Josh Lueke and Matthew Lawson. That Lueke had been arrested for rape and sodomy in 2008 and later pleaded no contest to a reduced charge of false imprisonment with violence cast a shadow over the deal. In all, Lee would spend 70 days as a Mariner.",
    "photo": "espnmag_cover.jpg",
    "crowd": 3
  },
  {
    "date": 2010,
    "body": "Jose Lopez (.239/.270/.339) bats cleanup EIGHTY EIGHT times. Really. The Mariners score a league-worst 513 runs (29th: PIT, 587).",
    "crowd": 2
  },
  {
    "date": "May 2010",
    "body": "Ken Griffey Jr. reportedly sleeps through a pinch-hitting opportunity. “He was asleep in the clubhouse,” one player [told News Tribune reporter Larry Larue](http://blog.thenewstribune.com/mariners/2010/05/10/for-griffey-the-mariners-the-end-is-near/). “He’d gone back about the fifth inning to get a jacket and didn’t come back. I went back in about the seventh inning — and he was in his chair, sound asleep.” Weeks later, [according Sports Illustrated’s account](https://www.si.com/mlb/2016/06/29/ken-griffey-jr-hall-of-fame-where-are-they-now), Griffey drove off into the night — literally — mid-series and announced his retirement 48 hours later.",
    "photo": "2010-web.jpg",
    "full": "x",
    "crowd": 1
  },
  {
    "date": "2010-11",
    "body": "The Mariners finish back-to-back seasons with the fewest runs scored in the major leagues, 513 in 2010 and 556 in 2011.",
    "crowd": 0
  },
  {
    "date": "July 2011",
    "body": "Three weeks. The Mariners go three weeks without winning a game. From July 6 to July 26, Seattle dropped 17 in a row. Within here, they also went 30 innings without scoring a run. Mercifully, it came to an end with a 9-2 victory over the Yankees 21 days later, but not before the M’s had fallen from 2.5 games back of the division lead to 15.",
    "crowd": 0
  },
  {
    "date": "Aug. 15, 2012",
    "body": "PERFECT! If there has been any singular game to immortalize Felix Hernandez in Mariners lore, he finished it like royalty. The King twirled and pointed to the sky — he had retired 27 straight Rays, striking out eight of the final 12, to throw the 23rd perfect game in major-league history.",
    "photo": "2012-web.jpg",
    "full": "x",
    "crowd": 6
  },
  {
    "date": "Dec. 12, 2013",
    "body": "Robinson Cano signs a 10-year, $240 million contract with the Mariners, at the time tied for the fourth-largest in major-league history and a Seattle franchise record.",
    "crowd": 5
  },
  {
    "date": "September 2014",
    "body": "Felix Hernandez comes the closest he ever has to pitching in a postseason game — in front of a sold-out Safeco Field, the Mariners’ playoff hopes still alive in Game 162. They won their final four games, fulfilling their end of a lofty task to make up for losing their previous five. But it’s not enough to catch the A’s and Blue Jays, and the gem Hernandez spun the day of Sept. 28 was for nothing. Seattle finished ONE game back of a wild-card spot.",
    "photo": "2014-web.jpg",
    "crowd": 3
  },
  {
    "date": "Aug. 28, 2015",
    "header": "Jack Zduriencik fired",
    "crowd": 4
  },
  {
    "date": "Sept. 28, 2015",
    "header": "The Jerry Dipoto era begins",
    "crowd": 4
  }
]