{
  "intro": {
    "text": "The year is 2001, and Seattle is awash in America’s past time. Fresh off hosting a sun-drenched All-Star Game in a brand-new ballpark — a going-away party for two of baseball’s all-time greats and a celebration of its newest sensation in front of its home crowd — the city could have hardly known it was nearing the end of the most successful stretch in franchise history, seven years in which the Mariners would make four playoff appearances and nearly 20 million fans would cross the turnstiles. They broke a century-old MLB record and were home to some of the game’s biggest names. \n\nThose years were not without strife, and those that followed were full of it. Stars departed; a World Series was never won. And over the cliff, the longest postseason drought of any team in professional sports.\n\nSo how did they get here, and what went wrong? We take you to the fall of 2001. The Mariners, with their 116 regular-season wins, have been convincingly eliminated in the American League Championship Series by those…"
  },
  "outro": {
    "text": "It took Jerry Dipoto a week to complete his first trade. Appropriately, it was a six-player swap. And since, he’s made deals at such a rapid pace it makes the Mariners’ managerial churn appear snaillike. Two and a half years into his tenure, seven players remain from the 40-man roster he inherited. There have been winners — acquiring Jean Segura and Mitch Haniger from Arizona — and losers — Chris Taylor for a starter who couldn’t lower his ERA below 7 at Triple-A, “clearly the worst deal I’ve ever made,” Dipoto later assessed. But many exist in the ether of minor swaps and the waiver wire. There’s no question Trader Jerry has begun to shape the organization in his image. But will he find any more success than his predecessors?"
  },
  "why": {
    "text": "### 1. Potent Lineup \n\nThe Mariners should score runs. The first five hitters in their projected everyday lineup — Dee Gordon, Jean Segura, Robinson Cano, Nelson Cruz and Kyle Seager — are previous All-Stars with career résumés that reflect their success and paychecks. The addition of Gordon, to go with Segura at the top of the order, allows Seattle not to rely just on homers. The Mariners can create runs with their legs. Gordon has stolen more than 50 bases in three seasons, including 60 in 2017. \n\nThe Mariners believe Seager won’t be as streaky this season after finally settling on a swing. Cano and Cruz are each a year older but are still productive and dangerous. \n\nBut what could make the lineup particularly potent are the hitters after the first five. Seattle will use Ryon Healy, Mitch Haniger and Mike Zunino in the No. 6,7,8 spots in some varied order. Healy and Zunino have legitimate power, each hitting 25 homers last season. Haniger’s first 20 games last season and the final 29 games of the season were brilliant, as he displayed his hitting versatility. \n\n### 2. Paxton power \n\n![James Paxton](./assets/reasons/Paxton-cut.jpg)\n\nJames Paxton has done everything to be healthy for 2018 and become the type of dominant starter that he was for extended periods last season. Armed with a mid- to high-90 mph fastball, a nasty curveball and cutter and an improved changeup, he has all the tools to be one of the best starting pitchers in the American League. \n\nHe posted a 12-5 record with a 2.98 ERA in 24 starts last season. He struck out 156  in 136 innings and career marks in wins, starts, innings, strikeouts and ERA (2.98). \nBut that success was interrupted by two  stints on the disabled list because of  a forearm strain and later a pectoral strain. His absence crushed a Mariners’ rotation he had been anchoring. \n\nIn past offseasons, he’s modified his routine to trim unneeded weight  and become more flexible with the use of hot yoga. This season he revamped his diet, removing all cow’s milk and related products in an effort to remain healthy. \n\nIf he gives Seattle 30 starts, it would take some pressure off the rest of the staff. \n\n### 3. Pleasant surprises \n\nRealistically, the Mariners need more than a few surprising contributions or performances that exceed expectations. They have a good idea what they’ll get from  established players, particularly the position group, but if a starter like Marco Gonzales can put together or a strong season or if hard-throwing reliever Dan Altavilla can harness his stuff and be a reliable set-up man, the Mariners could have a different outlook. \n\nGonzales, with a new natural arm slot and two years removed from Tommy John surgery,  has looked outstanding this spring. He has given a glimpse of why he was a first-round draft pick and a touted prospect with the Cardinals. Altavilla adjusted his slider grip, simplified his mechanics and has been one of Seattle’s best relievers this spring. \n\nAfter two seasons of dealing with injuries, it would be a pleasant surprise if Felix Hernandez could make 28 to 30 starts and display a level of consistency with his command. While no one expects Hernandez to be the King Felix of five years ago, there is a belief that cleaner mechanics and a simpler delivery will allow him to be a useful starter if he stays healthy. \n"
  },
  "why_not": {
    "text": "### 1. Injuries \n\nEvery team deals with them, but in the past few seasons and even this spring, it seems as if the Mariners have had to deal with them more than the rest. \n\nThe Mariners’ bullpen, which the front office and coaching staff considered to be a strength, was dealt a body blow when David Phelps suffered a torn ulnar collateral ligament in his elbow, ending his season before it started. Phelps was supposed to pair with Juan Nicasio as shutdown set-up men before closer Edwin Diaz. \n\nSeattle will be without outfielder Ben Gamel (oblique strain) for the first month of the season, and No. 5 starter Erasmo Ramirez (lat strain) won’t make his first scheduled start. Their early absence isn’t ideal for a team that wants/needs to get off to a strong start. \n\nAnd Ichiro at age 44, Cruz at 37 and Cano at 35 are injury risks, and Hernandez and Paxton have also dealt with their injury issues. \n\n### 2. The competition \n\n![Shohei Ohtani](./assets/reasons/Ohtani-cut.jpg)\n\nThe American League West features the defending World Series champion Houston Astros, a team that the Mariners have struggled to beat since they joined the division, posting a 39-55 record against over the last five seasons. Houston returns the bulk of its team and many in baseball are predicting  back-to-back titles.\n\nThe Angels should be improved, adding second baseman Ian Kinsler and third baseman Zack Cozart to their infield, and retaining outfielder Justin Upton to go with all-everything center fielder Mike Trout. The Angels’ pitching — both the rotation and bullpen —- is a question mark, even with the addition of Shohei Ohtani. Still, many insiders feel they are better than the Mariners. \n\nThe American League could be dominated by four “super” teams — the Astros, Yankees, Indians and Red Sox. Even with Minnesota’s success last season, Cleveland seems to be a lock in the AL Central while the Yankees and Red Sox will battle in the AL East with the loser likely to grab with top wild card spot. Unlike past years when the  second wild card team got into the postseason with 85 to 86 wins, it’s very possible that the second-wild card team could need to win closer to 88 to 90 games. Does Seattle seem like an 88-win team? \n\n### 3. Just because \n\n![A Mariners cap with the upside-down trident](./assets/reasons/Trident-Cap.jpg)\n\nMaybe it’s bad luck or the curse of the upside down trident. \n\nMaybe it’s the baseball gods punishing them for past sins like the Erik Bedard trade and the Heathcliff Slocumb trade before that. \n\nMaybe it should be expected. \n\nFor any number of reasons discussed, the Mariners have not made the postseason since 2001. Breaking that trend isn’t simple. It gets into the heads of fans and coaches and players. \n\n“What’s going to go wrong first?” \n\n“What bad thing will happen next?” \n\nIt’s easy to see all that can go wrong  this season: \n\nInjuries, continued to age-related regression from Cano, Cruz and Hernandez. League-adjustment regression for Haniger, Gamel and Gonzales. Injuries and a lack of roster and organizational depth exposed. \n\nAny of those things could be crushing to the Mariners postseason hopes. \n"
  }
}